idea-box/app/controllers/categories_controller.rb

  def create
    @category = Category.create(category_params)
---
INSERT INTO "categories" ("name") VALUES ($1) RETURNING "id"  [["name", "Wow"]]

  def destroy
    flash.notice = "YOU DELETED: #{@category.ideas.count} IDEAS!"
    ideas = @category.ideas
    ideas.each do |idea|
      idea.delete
    end
    @category.delete
---
SELECT COUNT(*) FROM "ideas" WHERE "ideas"."category_id" = $1  [["category_id", 1]]
SELECT "ideas".* FROM "ideas" WHERE "ideas"."category_id" = $1  [["category_id", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 1]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 4]]

  def load_category
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 4]]