idea-box/app/controllers/ideas_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    if current_user
      @idea = Idea.new(user_id: current_user.id)
      @categories = Category.all

INSERT INTO "ideas" ("title", "description", "user_id", "category_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Egory"], ["description", "Cat"], ["user_id", 1], ["category_id", 1]]
---
  def create
    @idea = Idea.create(idea_params)

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "categories".* FROM "categories"
---
  def edit
    @idea = Idea.find(params[:id])
    @categories = Category.all

UPDATE "ideas" SET "title" = $1, "description" = $2 WHERE "ideas"."id" = $3  [["title", "Test Again"], ["description", "Testing: 1, 2, 3, 4"], ["id", 1]]
---
  def update
    if @idea.update(idea_params)

DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 2]]
---
  def destroy
    @idea.delete

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 3]]
---
  def load_idea
    @idea = Idea.find(params[:id])