idea-box/app/controllers/images_controller.rb

  def create
    @image = Image.create(image_params)
---
INSERT INTO "images" ("address") VALUES ($1) RETURNING "id"  [["address", "https://images.unsplash.com/photo-1439396087961-98bc12c21176?q=80&fm=jpg&s=bce7579fe32b464cc2d53c5c144a2de4"]]

  def edit
    @image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 2]]

  def destroy
    @image.delete
---
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 2]]

  def load_image
    @image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 2]]