idea-box/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "rb"], ["password_digest", "$2a$10$mpDFbVViwmB7k3eVMn/33.Rg9Tkb5f.ItVGSD9.s9Dg4XQfXalqEu"], ["created_at", "2015-09-19 20:12:35.717989"], ["updated_at", "2015-09-19 20:12:35.717989"]]
---
  def create
    user = User.create(user_params)